<?xml version="1.0" ?>
<net batch="1" name="LapNet_chkpt_better_epoch17274_GPU0" version="6">
	<layers>
		<layer id="0" name="input" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="1113" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="5" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="540"/>
				<biases offset="540" size="20"/>
			</blobs>
		</layer>
		<layer id="2" name="1115" precision="FP32" type="PReLU">
			<data channel_shared="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="560" size="4"/>
			</blobs>
		</layer>
		<layer id="3" name="1116" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="1117" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1118" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="564" size="64"/>
				<biases offset="628" size="8"/>
			</blobs>
		</layer>
		<layer id="6" name="1120" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="3,3" output="2" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="636" size="72"/>
				<biases offset="708" size="8"/>
			</blobs>
		</layer>
		<layer id="7" name="1122" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="3,3" output="2" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="716" size="72"/>
				<biases offset="788" size="8"/>
			</blobs>
		</layer>
		<layer id="8" name="1124" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="3,1" output="2" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="796" size="24"/>
				<biases offset="820" size="8"/>
			</blobs>
		</layer>
		<layer id="9" name="1126" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="1,3" output="2" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="828" size="24"/>
				<biases offset="852" size="8"/>
			</blobs>
		</layer>
		<layer id="10" name="1128" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="1,3" output="2" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="860" size="24"/>
				<biases offset="884" size="8"/>
			</blobs>
		</layer>
		<layer id="11" name="1130" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="3,1" output="2" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="892" size="24"/>
				<biases offset="916" size="8"/>
			</blobs>
		</layer>
		<layer id="12" name="1132" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="1153/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<custom offset="924" size="20"/>
			</blobs>
		</layer>
		<layer id="14" name="1154" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="1155" precision="FP32" type="Permute">
			<data order="0,2,1,3,4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>2</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>4</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="1160/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="944" size="16"/>
			</blobs>
		</layer>
		<layer id="17" name="1161" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>4</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="1162" precision="FP32" type="PReLU">
			<data channel_shared="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="960" size="4"/>
			</blobs>
		</layer>
		<layer id="19" name="1163" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="964" size="128"/>
				<biases offset="1092" size="32"/>
			</blobs>
		</layer>
		<layer id="20" name="1165" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="1166" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="1167" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1124" size="128"/>
				<biases offset="1252" size="16"/>
			</blobs>
		</layer>
		<layer id="23" name="1169" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="3,3" output="2" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1268" size="144"/>
				<biases offset="1412" size="8"/>
			</blobs>
		</layer>
		<layer id="24" name="1171" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="1,1" output="2" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1420" size="16"/>
				<biases offset="1436" size="8"/>
			</blobs>
		</layer>
		<layer id="25" name="1173" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="3,1" output="2" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1444" size="48"/>
				<biases offset="1492" size="8"/>
			</blobs>
		</layer>
		<layer id="26" name="1175" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="1,3" output="2" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1500" size="24"/>
				<biases offset="1524" size="8"/>
			</blobs>
		</layer>
		<layer id="27" name="1177" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="1,3" output="2" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1532" size="48"/>
				<biases offset="1580" size="8"/>
			</blobs>
		</layer>
		<layer id="28" name="1179" precision="FP32" type="Convolution">
			<data dilations="1,1" group="2" kernel="3,1" output="2" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1588" size="24"/>
				<biases offset="1612" size="8"/>
			</blobs>
		</layer>
		<layer id="29" name="1181" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="4">
					<dim>1</dim>
					<dim>8</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="5">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="1202/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1620" size="20"/>
			</blobs>
		</layer>
		<layer id="31" name="1203" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="1204" precision="FP32" type="Permute">
			<data order="0,2,1,3,4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="1209/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1640" size="16"/>
			</blobs>
		</layer>
		<layer id="34" name="1210" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="1211" precision="FP32" type="PReLU">
			<data channel_shared="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1656" size="4"/>
			</blobs>
		</layer>
		<layer id="36" name="1212" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1660" size="256"/>
				<biases offset="1916" size="64"/>
			</blobs>
		</layer>
		<layer id="37" name="1213" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1980" size="256"/>
				<biases offset="2236" size="16"/>
			</blobs>
		</layer>
		<layer id="38" name="1215" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2252" size="144"/>
				<biases offset="2396" size="16"/>
			</blobs>
		</layer>
		<layer id="39" name="1217" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2412" size="144"/>
				<biases offset="2556" size="16"/>
			</blobs>
		</layer>
		<layer id="40" name="1219" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,1" output="4" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2572" size="48"/>
				<biases offset="2620" size="16"/>
			</blobs>
		</layer>
		<layer id="41" name="1221" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,3" output="4" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2636" size="48"/>
				<biases offset="2684" size="16"/>
			</blobs>
		</layer>
		<layer id="42" name="1223" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,3" output="4" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2700" size="48"/>
				<biases offset="2748" size="16"/>
			</blobs>
		</layer>
		<layer id="43" name="1225" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,1" output="4" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2764" size="48"/>
				<biases offset="2812" size="16"/>
			</blobs>
		</layer>
		<layer id="44" name="1227" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="1248/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1620" size="20"/>
			</blobs>
		</layer>
		<layer id="46" name="1249" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="1250" precision="FP32" type="Permute">
			<data order="0,2,1,3,4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="1255/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1640" size="16"/>
			</blobs>
		</layer>
		<layer id="49" name="1256" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="1257" precision="FP32" type="PReLU">
			<data channel_shared="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2828" size="4"/>
			</blobs>
		</layer>
		<layer id="51" name="1258" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2832" size="256"/>
				<biases offset="3088" size="64"/>
			</blobs>
		</layer>
		<layer id="52" name="1260" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="1261" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3152" size="256"/>
				<biases offset="3408" size="16"/>
			</blobs>
		</layer>
		<layer id="54" name="1263" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3424" size="144"/>
				<biases offset="3568" size="16"/>
			</blobs>
		</layer>
		<layer id="55" name="1265" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3584" size="144"/>
				<biases offset="3728" size="16"/>
			</blobs>
		</layer>
		<layer id="56" name="1267" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,1" output="4" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3744" size="48"/>
				<biases offset="3792" size="16"/>
			</blobs>
		</layer>
		<layer id="57" name="1269" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,3" output="4" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3808" size="48"/>
				<biases offset="3856" size="16"/>
			</blobs>
		</layer>
		<layer id="58" name="1271" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,3" output="4" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3872" size="48"/>
				<biases offset="3920" size="16"/>
			</blobs>
		</layer>
		<layer id="59" name="1273" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,1" output="4" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3936" size="48"/>
				<biases offset="3984" size="16"/>
			</blobs>
		</layer>
		<layer id="60" name="1275" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="1296/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1620" size="20"/>
			</blobs>
		</layer>
		<layer id="62" name="1297" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="1298" precision="FP32" type="Permute">
			<data order="0,2,1,3,4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="1303/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1640" size="16"/>
			</blobs>
		</layer>
		<layer id="65" name="1304" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="1305" precision="FP32" type="PReLU">
			<data channel_shared="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4000" size="4"/>
			</blobs>
		</layer>
		<layer id="67" name="1306" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4004" size="256"/>
				<biases offset="4260" size="64"/>
			</blobs>
		</layer>
		<layer id="68" name="1308" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="1309" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4324" size="256"/>
				<biases offset="4580" size="16"/>
			</blobs>
		</layer>
		<layer id="70" name="1311" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4596" size="144"/>
				<biases offset="4740" size="16"/>
			</blobs>
		</layer>
		<layer id="71" name="1313" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4756" size="144"/>
				<biases offset="4900" size="16"/>
			</blobs>
		</layer>
		<layer id="72" name="1315" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,1" output="4" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4916" size="48"/>
				<biases offset="4964" size="16"/>
			</blobs>
		</layer>
		<layer id="73" name="1317" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,3" output="4" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4980" size="48"/>
				<biases offset="5028" size="16"/>
			</blobs>
		</layer>
		<layer id="74" name="1319" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,3" output="4" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5044" size="48"/>
				<biases offset="5092" size="16"/>
			</blobs>
		</layer>
		<layer id="75" name="1321" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,1" output="4" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5108" size="48"/>
				<biases offset="5156" size="16"/>
			</blobs>
		</layer>
		<layer id="76" name="1323" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="1344/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1620" size="20"/>
			</blobs>
		</layer>
		<layer id="78" name="1345" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="1346" precision="FP32" type="Permute">
			<data order="0,2,1,3,4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="1351/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1640" size="16"/>
			</blobs>
		</layer>
		<layer id="81" name="1352" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="1353" precision="FP32" type="PReLU">
			<data channel_shared="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5172" size="4"/>
			</blobs>
		</layer>
		<layer id="83" name="1354" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5176" size="256"/>
				<biases offset="5432" size="64"/>
			</blobs>
		</layer>
		<layer id="84" name="1356" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="1357" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5496" size="256"/>
				<biases offset="5752" size="16"/>
			</blobs>
		</layer>
		<layer id="86" name="1359" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5768" size="144"/>
				<biases offset="5912" size="16"/>
			</blobs>
		</layer>
		<layer id="87" name="1361" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5928" size="144"/>
				<biases offset="6072" size="16"/>
			</blobs>
		</layer>
		<layer id="88" name="1363" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,1" output="4" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6088" size="48"/>
				<biases offset="6136" size="16"/>
			</blobs>
		</layer>
		<layer id="89" name="1365" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,3" output="4" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6152" size="48"/>
				<biases offset="6200" size="16"/>
			</blobs>
		</layer>
		<layer id="90" name="1367" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,3" output="4" pads_begin="0,1" pads_end="0,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6216" size="48"/>
				<biases offset="6264" size="16"/>
			</blobs>
		</layer>
		<layer id="91" name="1369" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,1" output="4" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6280" size="48"/>
				<biases offset="6328" size="16"/>
			</blobs>
		</layer>
		<layer id="92" name="1371" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="1392/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>5</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1620" size="20"/>
			</blobs>
		</layer>
		<layer id="94" name="1393" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="1394" precision="FP32" type="Permute">
			<data order="0,2,1,3,4"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="1399/Output_0/Data__const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="1640" size="16"/>
			</blobs>
		</layer>
		<layer id="97" name="1400" precision="FP32" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="1401" precision="FP32" type="PReLU">
			<data channel_shared="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6344" size="4"/>
			</blobs>
		</layer>
		<layer id="99" name="1402" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,1" output="16" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6348" size="256"/>
				<biases offset="6604" size="64"/>
			</blobs>
		</layer>
		<layer id="100" name="1404" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="1405" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="1406" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="1,1" output="8" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6668" size="512"/>
				<biases offset="7180" size="32"/>
			</blobs>
		</layer>
		<layer id="103" name="1408" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,3" output="4" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7212" size="288"/>
				<biases offset="7500" size="16"/>
			</blobs>
		</layer>
		<layer id="104" name="1410" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="1,1" output="4" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>4</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7516" size="32"/>
				<biases offset="7548" size="16"/>
			</blobs>
		</layer>
		<layer id="105" name="1412" precision="FP32" type="Convolution">
			<data dilations="1,1" group="4" kernel="3,1" output="4" pads_begin="1,0" pads_end="1,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
